# Welcome to the Data Manipulation Exercises

The workbook has been broken up into three sections.  Each section correlates to a reading assignment within the textbook.

In [7]:
import pandas as pd
import numpy as np

data= pd.read_csv("./titanic.csv")

## Before You Get Started

We are going to be using the Titanic Dataset. Make sure to run a head() before you start working with manipulation methods.

In [9]:
# Run the head of your data set here:

print(data.head())

   survived  pclass     sex   age  sibsp  parch     fare embarked  class  \
0         0       3    male  22.0      1      0   7.2500        S  Third
1         1       1  female  38.0      1      0  71.2833        C  First
2         1       3  female  26.0      0      0   7.9250        S  Third
3         1       1  female  35.0      1      0  53.1000        S  First
4         0       3    male  35.0      0      0   8.0500        S  Third

     who  adult_male deck  embark_town alive  alone
0    man        True  NaN  Southampton    no  False
1  woman       False    C    Cherbourg   yes  False
2  woman       False  NaN  Southampton   yes   True
3  woman       False    C  Southampton   yes  False
4    man        True  NaN  Southampton    no   True

In [10]:
# check for duplicates
duplicates = data.duplicated()
print(duplicates)

0      False
1      False
2      False
3      False
4      False
       ...
886     True
887    False
888    False
889    False
890    False
Length: 891, dtype: bool

In [12]:
# if there are, go ahead and drop them:
new_dataset = data.drop_duplicates(subset=None, keep='first', inplace=False)
print(new_dataset)

     survived  pclass     sex   age  sibsp  parch     fare embarked  class  \
0           0       3    male  22.0      1      0   7.2500        S  Third
1           1       1  female  38.0      1      0  71.2833        C  First
2           1       3  female  26.0      0      0   7.9250        S  Third
3           1       1  female  35.0      1      0  53.1000        S  First
4           0       3    male  35.0      0      0   8.0500        S  Third
..        ...     ...     ...   ...    ...    ...      ...      ...    ...
885         0       3  female  39.0      0      5  29.1250        Q  Third
887         1       1  female  19.0      0      0  30.0000        S  First
888         0       3  female   NaN      1      2  23.4500        S  Third
889         1       1    male  26.0      0      0  30.0000        C  First
890         0       3    male  32.0      0      0   7.7500        Q  Third

       who  adult_male deck  embark_town alive  alone
0      man        True  NaN  Southampton    no  False
1    woman       False    C    Cherbourg   yes  False
2    woman       False  NaN  Southampton   yes   True
3    woman       False    C  Southampton   yes  False
4      man        True  NaN  Southampton    no   True
..     ...         ...  ...          ...   ...    ...
885  woman       False  NaN   Queenstown    no  False
887  woman       False    B  Southampton   yes   True
888  woman       False  NaN  Southampton    no  False
889    man        True    C    Cherbourg   yes   True
890    man        True  NaN   Queenstown    no   True

[784 rows x 15 columns]

### Cleaning Note:

While the columns are not the "prettiest", don't adjust any of them yet. We are going to update some values and add some values as we workthrough this notebook. Applologies for the extra visual "noise" on your screen. You will be given the option to tidy up the columns at the end of this notebook.

## Running Tables Note:  
If your tables don't appear to have accepted your changes, try the "Run All" option in the "Cell" section of the menu bar.

<span style="background-color:dodgerblue; color:dodgerblue;">- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -</span>

# A. Aggregation

1. Work through the section Exercises.  
    - There are 4 sections in part A:
        - Groupby
        - Aggregation Methods
        - Groupby and Basic Math
        - Groupby and Multiple Aggregations

#### Creating Variables.

As we begin to manipulate our data, create new variables to store your work in.  This will keep your original data in tact.  Having the original dataset available will save you time with each manipulation.  You can also create variable names that inform you of the purpose of the manipulation.

### 1: Groupby <span style="color:dodgerblue;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span>

#### Groupby "embark_town"

1. Using the titanic data set, groupby "embark_town".
1. Create a variable that will represent the grouping of data. 
1. Intitalize it using the groupby() function and pass it the column.

In [18]:
# Code your groupby "embark_town" here:
grouping_variable = new_dataset.groupby(["embark_town"]).sum()

In [26]:
# To view the grouped data as a table, use the variable_name.first():
grouping_variable = new_dataset.groupby(["embark_town"]).first()
print(grouping_variable)

             survived  pclass     sex   age  sibsp  parch     fare embarked  \
embark_town
Cherbourg           1       1  female  38.0      1      0  71.2833        C
Queenstown          0       3    male   2.0      0      0   8.4583        Q
Southampton         0       3    male  22.0      1      0   7.2500        S

             class    who  adult_male deck alive  alone
embark_town
Cherbourg    First  woman       False    C   yes  False
Queenstown   Third    man        True    C    no   True
Southampton  Third    man        True    C    no  False

#### Groupby "survived"

Did you know that you can also chain on some of our exploratory methods to the groupby method?

1. Create & initalize a new variable to hold a table that will groupby "survived" 
1. Use method chaining to tack on the describe method

In [28]:
# Code your groupby "survived" table here:
grouping_variable_survived = new_dataset.groupby(["survived"]).sum()

# run your table below:
grouping_variable_survived = new_dataset.groupby(["survived"]).first()
print(grouping_variable_survived)

          pclass     sex   age  sibsp  parch     fare embarked  class    who  \
survived
0              3    male  22.0      1      0   7.2500        S  Third    man
1              1  female  38.0      1      0  71.2833        C  First  woman

          adult_male deck  embark_town alive  alone
survived
0               True    E  Southampton    no  False
1              False    C    Cherbourg   yes  False

In [33]:
# run your table with describe
grouped_data = new_dataset.groupby('survived').describe()
print(grouped_data)

         pclass                                                 age  \
          count      mean       std  min  25%  50%  75%  max  count
survived
0         461.0  2.481562  0.770507  1.0  2.0  3.0  3.0  3.0  394.0
1         323.0  1.904025  0.856152  1.0  1.0  2.0  3.0  3.0  284.0

                     ... parch        fare                                     \
               mean  ...   75%  max  count       mean        std  min     25%
survived             ...
0         30.953046  ...   0.0  6.0  461.0  23.944531  33.336385  0.0   7.875
1         28.365915  ...   1.0  5.0  323.0  50.079180  68.009971  0.0  12.825


            50%       75%       max
survived
0         13.00  26.55000  263.0000
1         26.25  61.37915  512.3292

[2 rows x 40 columns]

In [9]:
# How is this table organized?  Why are there 40 columns now?
It calculates the summary statistics for each numerical column

### 2. Aggregation Methods <span style="color:dodgerblue;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span>

Note: **agg()** and **aggregate()** are identical [source](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.aggregate.html)

#### Method Chaining

1. Create a variable to method chain **head()** and **agg()** togehter.
1. Pass one of the following statistical values to **agg()**
   - "mean", "median", "mode", "min", "max", "std", "var", "first", "last", "sum"

In [52]:
# Code your method chain here:
grouped_summary = new_dataset.groupby('survived').agg({
    'fare': ['sum', 'mean'],'age': 'count'}).head()
print(grouped_summary)

              fare              age
               sum       mean count
survived
0          15.3000   7.650000     2
1         132.3083  44.102767     3

In [53]:
# Create a variable to method chain head() with agg("sum")
grouped_sum = new_dataset.groupby('survived').agg("sum").head()
print(grouped_sum)
# run your table:

          pclass                 sex   age  sibsp  parch      fare embarked  \
survived
0              6            malemale  57.0      1      0   15.3000       SS
1              5  femalefemalefemale  99.0      2      0  132.3083      CSS

                    class              who  adult_male deck  \
survived
0              ThirdThird           manman           2    0
1         FirstThirdFirst  womanwomanwoman           0   CC

                              embark_town      alive  alone
survived
0                  SouthamptonSouthampton       nono      1
1         CherbourgSouthamptonSouthampton  yesyesyes      1

In [12]:
# Explain the sum table.  What is going on with the "sex", "class", and "alive" columns?

Sex, Class and alive is the string column, where pandas will sum these by concatenating the string values together within each group.

#### Using a Dictionary <span style="color:darkorange;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span> 
##### A dictionary is a Python collection type.  

Is a collection type that stores **key-value pairs**.  A key-value pair is an orgainzation system that is made up of a single *key* that has one or more *values* paired with it.  
Think of it like your contacts list.  The contacts list is the dictionary object.  
Each contact is organized by a key, usually name.  And attached to each name is contact information, or the values.
Some contacts might have email address, phone number, home or work address, etc. Other contacts may just be a name and phone number.  This is a very simple example, but understanding this orgainzational structure will be helpful as you learn to manipulate tables.  

*Here is a dictionary example with 3 keys:*
>**contacts_dictionary = {"name1": ["email", 555-5552, "work info"], 
      "name2": ["email", 555-5554],
      "name3": 555-5555}**
                     
*Here is a dictionary example with a single key-value pair*
**study_group_dictionary = {"name1": 555-5557}**   

It has a single key, and a list of values. The organization of this structure is called a "Key-Value Pair".
Using the contact list example, the key would be the name of the person and the values would be their contact information.  The key is a single item (the person's name) and the values can be a single item (an email address) or mulitple items (email, phone number, address, work info, etc).
Keys and values can be any data type, but must use correct data type syntax.  The keys do not have to be strings, but they do need to be a single value.  

For more information, you can read more on dictionary objects [here](https://www.w3schools.com/python/python_dictionaries.asp).

#### Aggregation across muliple columns using dictionary functionality

##### Syntax Example:

**age_dictionary={"age":["sum", "max"]}**

We are creating a new dictionary (**age_dictionary**).  The key is **age** and the values we want are **"sum""** and **"max"**.  This dictionary object has now become a tempate for the aggregations we want to preform.  However, on it's own, it does nothing.  Once passed to the **agg()** method, it will pick out the specific location of data we want to examine.  Making a subset table.  

The code is contained in the box below.  Run it and see what happens.


For syntax examples, review [this webpage](https://www.geeksforgeeks.org/python-pandas-dataframe-aggregate/).
#### <span style="color:coral;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span>

In [54]:
# Predict the table output before you uncomment the code below.

age_dictionary={"age":["sum", "max"]}
dictionary_agg=data.agg(age_dictionary)
dictionary_agg

          age
sum  21205.17
max     80.00

1. What if we want to look at more than one column at a time?  We pass more dictionaries to the agg function.
1. Create a variable to hold at least 3 columns.  Use the syntax from the "Syntax Example" as a guide.
    - Aggregate the following:  survived: "sum" & "count"; age: "std" & "min", and sibsp: "count" & "sum"

In [56]:
# Code your dictionary here:
age_dictionary={"age":["std", "min"],"survived":["sum","count"],"sibsp":["count","sum"]}
dictionary_agg=data.agg(age_dictionary)
dictionary_agg

             age  survived  sibsp
std    14.526497       NaN    NaN
min     0.420000       NaN    NaN
sum          NaN     342.0  466.0
count        NaN     891.0  891.0

### 3. Groupby and Basic Math <span style="color:dodgerblue;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span> 

1. Groupby "pclass".  Make sure you use a variable to hold your grouped data.

In [65]:
# Code your groupby here:
grouping_variable = new_dataset.groupby("pclass").first()

print(grouping_variable)

# Run your table using first() here instead of head():

        survived     sex   age  sibsp  parch     fare embarked  class    who  \
pclass
1              1  female  38.0      1      0  71.2833        C  First  woman
3              0    male  22.0      1      0   7.2500        S  Third    man

        adult_male  deck  embark_town alive  alone
pclass
1            False     C    Cherbourg   yes  False
3             True  None  Southampton    no  False

### 4. Groupby and Multiple Aggregations <span style="color:dodgerblue;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span>

#### Group with a List<span style="color:dodgerblue;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span>

1. We want to do muliple aggregation functions to our newly grouped data set.  We created a variable to hold a list of functions we want to perform.  These functions are part of the agg method.  When we pass our list to the method, the method will iterate through each item and perform that function for the entire table.

In [82]:
# our list of functions
agg_func_list = ['sum', 'mean', 'median', 'min', 'max', 'std', 'var', 'first', 'last', 'count']


#Apply the agg method to our passenger_class variable (made in the Groupby Basic Math section).  

passenger_class_variable ={"pclass":['sum', 'mean','median','min','max', 'std', 'var', 'count']}
passenger_class_data = new_dataset.agg(passenger_class_variable)
print(passenger_class_data)
# Pass our list to the function and run your table.

           pclass
sum     11.000000
mean     2.200000
median   3.000000
min      1.000000
max      3.000000
std      1.095445
var      1.200000
count    5.000000

#### Group with a Dictionary<span style="color:dodgerblue;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span>

Using only a list provides us with the entire table.  What if we only want to look at age vs pclass?  

we can create a dictionary to hold the age column for us.  The *key* would be the name of our column, and the values our list of functions to preform on that column.  The code would look like this:

In [93]:
agg_func_dict = {
    'age':
    ['sum', 'mean', 'median', 'min', 'max', 'std', 'var', 'first', 'last', 'count']
}
# We would run our table like this:
# passenger_class.agg(agg_func_dict)

Looking at the *age_func_dict* syntax, create a dictionary variable for the "survived" column and pass it to **passenger_class.agg()** in the box below.

In [92]:
# Code it here:

agg_func_dict = {
    'survived':
    ['sum', 'mean', 'median', 'min', 'max', 'std', 'var', 'first', 'last', 'count']
}
passenger_class = new_dataset.groupby("survived").agg(agg_func_dict)
print(passenger_class)

         survived
              sum mean median min max  std  var first last count
survived
0               0  0.0    0.0   0   0  0.0  0.0     0    0     2
1               3  1.0    1.0   1   1  0.0  0.0     1    1     3

<span style="background-color:dodgerblue; color:dodgerblue;">- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -</span>

# B. Recoding and Creating New Values and Variables 

1. Work through the Part B, there are 3 sections

### Create a New Column <span style="color:dodgerblue;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span> 

In the box below:
1. Create a new column by manipulating the values of different column.  Specifically, create a new column, "fare_2021" that allows us to compare the cost of fare in pounds back in 1912 to 2021.  [This website](https://www.in2013dollars.com/uk/inflation/1912) can help you find the 2021 fare amount.

In [19]:
# Code your new "fare_2021" column here:

# Run the head of your table to see your new column:

### Replacing Values <span style="color:dodgerblue;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span> 
 
Replace the values in the "alive" coloum from string "yes" or "no" to bools, where "yes" becomes True and "no" becomes False.

In [96]:
# Code your updated values here:

new_dataset["alive_reformatted"] = new_dataset["alive"].replace({"yes" : True, "no": False})
print(new_dataset)

   survived  pclass     sex   age  sibsp  parch     fare embarked  class  \
0         0       3    male  22.0      1      0   7.2500        S  Third
1         1       1  female  38.0      1      0  71.2833        C  First
2         1       3  female  26.0      0      0   7.9250        S  Third
3         1       1  female  35.0      1      0  53.1000        S  First
4         0       3    male  35.0      0      0   8.0500        S  Third

     who  adult_male deck  embark_town alive  alone  alive_reformatted
0    man        True  NaN  Southampton    no  False              False
1  woman       False    C    Cherbourg   yes  False               True
2  woman       False  NaN  Southampton   yes   True               True
3  woman       False    C  Southampton   yes  False               True
4    man        True  NaN  Southampton    no   True              False

/var/folders/2d/906cqx291nj35y4hsw4nlbn80000gn/T/ipykernel_5017/867462645.py:3: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  new_dataset["alive_reformatted"] = new_dataset["alive"].replace({"yes" : True, "no": False})

We can also use functions to update values.

1. Create a function that will set the alive values as bools. Apply it to your table and run your table here:

In [109]:
# Code your function here:
def set_alive_to_bool(new_dataset):
    new_dataset["alive"] = new_dataset["alive"].replace({"yes": True, "no": False})
    return new_dataset
    updated_new_dataset = set_alive_to_bool(new_dataset)
    print(updated_new_dataset)

### Using a function to create a new column <span style="color:dodgerblue;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span> 

Sometimes you might want to create a new column based on combining multiple columns together.

1. create an "age_group" column that breaks years up as 0-19, 20-29, 30-39, etc until all given ages are covered.  Make sure you check to see where you can stop counting by 10s.

In [108]:
# Write your max age check here:
max_age = new_dataset["age"].max()
print(max_age)

38.0

In [160]:
# Code the new "age_group" column function here:
max_age = new_dataset["age"].max()
bins = range(0, max_age + 10, 10)
labels = [f"{i}-{i+9}" for i in bins[:-1]]
new_dataset["age_group"] = pd.cut(new_dataset["age"], bins=bins, labels=labels, right=False)
print(new_dataset)

<span style="background-color:dodgerblue; color:dodgerblue;">- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -</span>

# C. Reshaping Tables

1. Work through Part C, there are 4 sections

### Sort_values <span style="color:dodgerblue;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span>

Use **sort_values()** to answer the following question:
> What is the age of the person who paid the highest fare?

Hint: We want to see the highest fare value first. What order would we want? ascending or descending?  Check the [documentation](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.sort_values.html?highlight=sort_values#pandas.DataFrame.sort_values) for the syntax.

In [115]:
# Code your sort_values here:
sorted_df = new_dataset.sort_values(by="fare", ascending=False)
highest_fare_age = sorted_df.iloc[0]["age"]
print(f"The age of the person who paid the highest fare is: {highest_fare_age}")

# Run your table here:

print(sorted_df.head())

The age of the person who paid the highest fare is: 38.0
   survived  pclass     sex   age  sibsp  parch     fare embarked  class  \
1         1       1  female  38.0      1      0  71.2833        C  First
3         1       1  female  35.0      1      0  53.1000        S  First
4         0       3    male  35.0      0      0   8.0500        S  Third
2         1       3  female  26.0      0      0   7.9250        S  Third
0         0       3    male  22.0      1      0   7.2500        S  Third

     who  adult_male deck  embark_town alive  alone  alive_reformatted
1  woman       False    C    Cherbourg   yes  False               True
3  woman       False    C  Southampton   yes  False               True
4    man        True  NaN  Southampton    no   True              False
2  woman       False  NaN  Southampton   yes   True               True
0    man        True  NaN  Southampton    no  False              False

### pivot_table <span style="color:dodgerblue;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span> 
1. pivot the table of the summed data where the values are "fare", index is "who" and "age_group", and the columns are "survived"

Hint: set the aggfunc parameter to np.sum

In [148]:
# Code your pivot_table here:

pivot_table = new_dataset.pivot_table(values='fare', index = "who", columns="survived", aggfunc="sum")
print(pivot_table)
# Run your table here:

survived     0         1
who
man       15.3       NaN
woman      NaN  132.3083

### Wide to Long <span style="color:dodgerblue;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span> 

1. Create a table where the columns are "who" and the values are "pclass"
1. Answer the question:  How does this table differ from the pivot_table above?  Specifically, how is "who" different?

In [141]:
# Code your table here:


long_dataframe = pd.DataFrame(new_dataset)
long_format_dataframe = pd.melt(long_dataframe, id_vars = ['who'], value_vars = ['pclass'])

# Run your table here:

print(long_format_dataframe)
# Answer the question here:

pivot table gives summarised data whereas long table gives all parameter separately.

     who variable  value
0    man   pclass      3
1  woman   pclass      1
2  woman   pclass      3
3  woman   pclass      1
4    man   pclass      3

### Melt <span style="color:dodgerblue;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span>

1.  What does **melt** to the data?

In [27]:
# What does melt do?
sed to reshape tables from wide format to long format

2. Melt to your data.  Be sure to store the output in a new variable.  What is the new shape of your table?

In [28]:
# Create your default melt table here with the following syntax:  new_name = pd.melt(data_set)

# Run your table here:
# data = []

# example_dataframe = pd.DataFrame(data)

# long_format_dataset = pd.melt(example_dataset, var_name='', value_name='')
# Check the shape of your new table.

3. Create a melt table where the index variables are "embarked", and the values are "fare" and "deck"

In [155]:
# Create your melt table here:

# Run your table here:
data = new_dataset

example_dataframe = pd.DataFrame(data)

long_format_dataset = pd.melt(example_dataframe, id_vars = ['embarked'], value_vars = ['fare', 'deck'])
print(long_format_dataset)
# Check the shape

  embarked variable    value
0        S     fare     7.25
1        C     fare  71.2833
2        S     fare    7.925
3        S     fare     53.1
4        S     fare     8.05
5        S     deck      NaN
6        C     deck        C
7        S     deck      NaN
8        S     deck        C
9        S     deck      NaN

# Optonal Challenges:

1. Clean and Explore the table.  
    1. How would you handle any missing data?
    1. Would you keep all of the columns?
    1. Would you want to manipulate any data?